--1)Вывести заглавными буквами список сотрудников с зарплатой от 1000$ до 2500$.

SELECT UPPER(fname||' '||lname) AS "fname-lname" FROM staff WHERE salary BETWEEN 1000 AND 2500;

--=============================================================================================

--2)Получить список телефонов и сотрудников, работающих в офисах Бреста или Минска.

SELECT fname||' '||lname AS "fname-lname", s.tel_no, city FROM staff s INNER JOIN branch b ON s.bno = b.bno WHERE city IN ('Minsk', 'Brest');

--============================================================================================================================================

--3)Определить и вывести суммарную и среднюю зарплату сотрудников в зависимости от занимаемой ими должности. 
--Подписать вычисляемые поля как «Суммарная зарплата» и «Средняя зарплата».

SELECT position, SUM(salary) суммарная_зп, AVG(salary) средняя_зп FROM staff GROUP BY position;

--==============================================================================================

--4)*Вывести должности, по которым суммарная заработная плата больше средней.

SELECT position FROM staff WHERE salary > (SELECT AVG(salary) FROM staff);